In [1]:
import numpy as np
import pandas as pd
from scipy import stats

### *EXERCISE 1*

The hourly wages in a particular industry are normally distributed with mean $13.20 and standard deviation $2.50. A company in this industry employs 40 workers, paying them an average of $12.20 per hour. Can this company be accused of paying substandard wages? Use an α = .01 level test.

In [2]:
H_0 = "This company can't  be accused of paying substandard wages?"
H_A = "This company can  be accused of paying substandard wages?"

In [3]:
x_bar = 12.20 # sample mean
mu = 13.20 # population mean
sigma = 2.50 # population std
n = 40 # sample
alpha = 0.01 # significance level

In [4]:
z = (x_bar - mu)/(sigma/np.sqrt(n))
z

-2.5298221281347035

In [5]:
p_value = 1 - stats.norm.cdf(z)
p_value

0.9942939818069991

In [6]:
if p_value<alpha:
    print("Reject The Null Hipothesis")
else:
    print("Fail To Reject The Null Hipothesis")

Fail To Reject The Null Hipothesis

### *EXERCISE 2*

Shear strength measurements derived from unconfined compression tests for two types of soils gave the results shown in the following document (measurements in tons per square foot). Do the soils appear to differ with respect to average shear strength, at the 1% significance level?

In [7]:
soil = pd.read_csv("soil.csv")

In [11]:
soil

    Soil1  Soil2
0   1.442  1.364
1   1.943  1.878
2   1.110  1.337
3   1.912  1.828
4   1.553  1.371
5   1.641  1.428
6   1.499  1.119
7   1.347  1.373
8   1.685  1.589
9   1.578  1.714
10  1.866  1.260
11  1.653  1.492
12  1.665  1.395
13  1.640  1.778
14  1.976  1.611
15  1.754  1.202
16  1.589  1.542
17  1.976  1.094
18  1.863  1.557
19  1.932  1.053
20  1.570  1.183
21  1.613  1.367
22  2.054  1.144
23  1.550  1.151
24  1.714  1.561
25  1.896  1.192
26  1.737  1.489
27  1.740  1.379
28  1.708  1.501
29  1.548  1.277
30    NaN  1.593
31    NaN  1.172
32    NaN  1.510
33    NaN  1.740
34    NaN  1.355

In [24]:
soil.dropna(inplace=True)

In [26]:
soil.head()

   Soil1  Soil2
0  1.442  1.364
1  1.943  1.878
2  1.110  1.337
3  1.912  1.828
4  1.553  1.371

In [29]:
diff = soil.Soil1 - soil.Soil2
diff.head()

0    0.078
1    0.065
2   -0.227
3    0.084
4    0.182
dtype: float64

In [31]:
d_mean = diff.mean()
d_mean

0.28416666666666673

In [33]:
d_std = diff.std()
d_std

0.29312937985356113

In [37]:
n = len(soil)
n

30

### *EXERCISE 3*

The following dataset is based on data provided by the World Bank (https://datacatalog.worldbank.org/dataset/education-statistics). World Bank Edstats.  2015 PISA Test Dataset

1. Get descriptive statistics (the central tendency, dispersion and shape of a dataset’s distribution) for each continent group (AS, EU, AF, NA, SA, OC).

2. Determine whether there is any difference (on the average) for the math scores among European (EU) and Asian (AS) countries (assume normality and equal variances). Draw side-by-side box plots.

In [20]:
pisa = pd.read_csv("2015 PISA Test.csv")

In [22]:
pisa.head()

,Country Code,Continent_Code,internet_users_per_100,Math,Reading,Science
0,ALB,EU,63.252933,413.1570,405.2588,427.2250
1,ARE,AS,90.500000,427.4827,433.5423,436.7311
2,ARG,SA,68.043064,409.0333,425.3031,432.2262
3,AUS,OC,84.560519,493.8962,502.9006,509.9939
4,AUT,EU,83.940142,496.7423,484.8656,495.0375